<template>
    <div class="mt-8 mb-16">
        <div class="container mx-auto">
            <h1 class="mb-4">隱私權政策</h1>

            <div class="text-gray-600">
                <p>
                    為了讓您能夠安心使用本網站的各項服務與資訊，特此向您說明本網站的隱私權保護政策，以保障您的權益並立即生效
                </p>

                <h2>1. 資料收集及用途</h2>
                <p>
                    為了向用戶提供有關服務，本網站會向相關用戶收集個人資料。除非事先獲得您的同意改變用途，或該用途為法律所准許，否則所收集的個人資料只限用於收集資料時擬使用或相關的目的。
                </p>

                <p>
                <ul class="list-disc list-inside">
                    <li>為了提供服務，本網站會向登記的商店收集 Instagram 公開用戶基本資料 以及 Instagram 公開貼文。</li>
                    <li>為了提供服務，本網站會向用戶收集（包括但不限於）電話、名稱、地址。</li>
                    <li>若你在本網站向商店購買產品或服務，你的個人資料將會被傳送至相關商店及你的個人資料將會根據相關商店的私隱政策被使用、處理及保留。</li>
                    <li>伺服器會自行記錄相關行徑，包括您使用連線設備的IP位址等瀏覽資料，以改善服務質素並防止濫用。此記錄只供內部應用，決不對外公佈。</li>
                    <li>
                        為了提供最佳的服務，本網站會在您的電腦中放置並取用Cookie。若您不願接受Cookie的寫入，您可在您使用的瀏覽器功能項中設定隱私權等級為高，即可拒絕Cookie的寫入，但可能會導至網站某些功能無法正常執行
                        。
                    </li>
                </ul>
                </p>

                <h2>2. 個人資料的保安</h2>
                <p>
                    接收您的個人資料後，系統會將資料存放在安全的第三方雲端服務。只在有需要的情況下，本網站的員工才可獲准存取您的個人資料，並且會盡可能只存取所需的部分。本網站會採取合理的措施保護您的個人資料，以防丟失、濫用和未經授權的訪問、披露、更改或破壞。
                </p>
                <h2>3. 個人資料與第三方傳輸</h2>
                <p>
                    除非事先徵得閣下的同意或在法律要求下，否則我們不會將閣下的資料轉移或披露給任何第三方。
                </p>
                <h2>4. 查詢或刪除個人資料</h2>
                <p>
                    閣下有權查詢閣下個人資料的內容、及更改任何不準確及不及時的資料及要求刪除您的資料。相關需求可以Instagram信息發送至 <a href="https://www.instagram.com/shoperuse/">＠shoperuse</a>。
                </p>
            </div>
        </div>
    </div>
</template>

<style scoped>
    h1 {
        @apply text-2xl
    }

    h2 {
        @apply text-xl text-gray-800 my-4
    }

    p {
        @apply mb-3
    }

    li {
        @apply mb-1 leading-5
    }
</style>
